tutorials/DXOverIsoFlow/staticBox/background/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

libs            ("liboversetAdv.so" "libfvMotionSolvers.so");

application     DXOverIsoFlow;

startFrom       latestTime;

startTime       0.0;

stopAt          endTime;

endTime         50;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       0.02;

// ************************************************************************* //
/*
functions
{
	forceOFfloatingBody
	{
		type            forces;
		libs            ("libforces.so");
	
		writeControl    timeStep;
		writeInterval   1;
	
		rhoInf          1000;
		log             on;

		patches     (floatingObject);
		CofR        (0 0 0);
	}
	surfaceElevation
	{
		type            sets;
		libs            ("libsampling.so");
		writeControl    timeStep;
		writeInterval   1;

		interpolationScheme cellPoint;

		setFormat       raw;

		sets
		(
    		GaugeVOF00
    		{
        		type    uniform;
        		nPoints  1600;
        		axis    z;
        		start   ( 0.0 0.01 -0.15 );
        		end     ( 0.0 0.01 0.35 );
    		}   
    		GaugeVOF01
    		{
        		type    uniform;
        		nPoints  800;
        		axis    z;
        		start   ( 0.3 0.01 -0.25 );
        		end     ( 0.3 0.01 0.3 );
    		}    
    		GaugeVOF02
    		{
        		type    uniform;
        		nPoints  1600;
        		axis    z;
        		start   ( 1.3 0.01 -0.15 );
        		end     ( 1.3 0.01 0.35 );
    		}    
		);
		fields          ( alpha.water );
	}
    patchProbes
    {
		type            probes;
		libs            ( "libsampling.so" );

		// Name of the directory for probe data
		name            probes;


		// Write at same frequency as fields
		writeControl    timeStep;
		writeInterval   1;


        // Optional: interpolation scheme to use (default is cell)
        interpolationScheme cell;

		fixedLocations  false;
		// Fields to be probed
		fields          (p p_rgh);

		// Locations to probe. These get snapped onto the nearest point
		// on the selected patches
		probeLocations
		(
				(0.45 0.01 0.04)
				(0.45 0.01 0.0)
				(0.35 0.01 -0.03)            
		);
    }
}*/
// ************************************************************************* //
